#### Staging Terraform Plan 📖
<details><summary>Plan: 3 to add, 0 to change, 1 to destroy. (Click to expand details)</summary>

```terraform
module.infrastructure.module.ingestion.data.aws_ecr_lifecycle_policy_document.ingestion_lambda: Reading...
module.infrastructure.aws_s3_bucket.data_storage_bucket: Refreshing state... [id=currency-converter-api-data-storage-bucket-staging]
module.infrastructure.module.ingestion.data.aws_ecr_lifecycle_policy_document.ingestion_lambda: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.infrastructure.aws_s3_bucket.data_storage_bucket will be destroyed
  # (because aws_s3_bucket.data_storage_bucket is not in configuration)
  - resource "aws_s3_bucket" "data_storage_bucket" {
      - arn                         = "arn:aws:s3:::currency-converter-api-data-storage-bucket-staging" -> null
      - bucket                      = "currency-converter-api-data-storage-bucket-staging" -> null
      - bucket_domain_name          = "currency-converter-api-data-storage-bucket-staging.s3.amazonaws.com" -> null
      - bucket_namespace            = "global" -> null
      - bucket_region               = "eu-west-1" -> null
      - bucket_regional_domain_name = "currency-converter-api-data-storage-bucket-staging.s3.eu-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1BKCTXD74EZPE" -> null
      - id                          = "currency-converter-api-data-storage-bucket-staging" -> null
      - object_lock_enabled         = false -> null
      - region                      = "eu-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "Data Storage Bucket"
        } -> null
      - tags_all                    = {
          - "Application" = "currency-converter-api"
          - "Environment" = "staging"
          - "Name"        = "Data Storage Bucket"
        } -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "d7515165b6d714f9846a3d51eb44e450a298d988a563754e27bb6d7f9050ff4f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.infrastructure.module.ingestion.aws_ecr_lifecycle_policy.ingestion_lambda will be created
  + resource "aws_ecr_lifecycle_policy" "ingestion_lambda" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images to save costs"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "currency-converter-api-ingestion-lambda-staging"
    }

  # module.infrastructure.module.ingestion.aws_ecr_repository.ingestion_lambda will be created
  + resource "aws_ecr_repository" "ingestion_lambda" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "currency-converter-api-ingestion-lambda-staging"
      + region               = "eu-west-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Application" = "currency-converter-api"
          + "Environment" = "staging"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.infrastructure.module.ingestion.aws_s3_bucket.data_storage_bucket will be created
  + resource "aws_s3_bucket" "data_storage_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "currency-converter-api-data-storage-bucket-staging"
      + bucket_domain_name          = (known after apply)
      + bucket_namespace            = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "Data Storage Bucket"
        }
      + tags_all                    = {
          + "Application" = "currency-converter-api"
          + "Environment" = "staging"
          + "Name"        = "Data Storage Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```
</details>

*Pushed by: @Ryhhill1998, Action: `pull_request`*